"""Задача 10: Удалите все повторяющиеся слова из списка, сохранив их порядок.
# Решение
words = ["яблоко", "банан", "яблоко", "груша", "банан", "слива"]
"""

words = ["яблоко", "банан", "яблоко", "груша", "банан", "слива"]
words_new = []

for word in words:
    if word not in  words_new:
        words_new.append(word)

print(", ".join(words_new))