"""Задача 11: Ищите слово "стоп" в списке. Если слово найдено, остановите цикл и выведите, сколько слов было до него.
# Решение
words = ["начало", "путь", "стоп", "дальше", "конец"]
"""

words = ["начало", "путь", "дальше", "стоп", "конец"]
count = -1
for word in words:
    count += 1
    if word == 'стоп':
        break
print(f"Слов до слова стоп:  {count}.")